create a series with following elements using a list [10,20,30,40]

In [3]:
import pandas as pd

In [71]:
s1=pd.Series([10,20,30,40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
s2=pd.Series([10,20,30,40], index=['a','b','c','d'])
s2

a    10
b    20
c    30
d    40
dtype: int64

In [72]:
s3=pd.Series({'a':10,'b':20,'c':30,'d':40})
s3

a    10
b    20
c    30
d    40
dtype: int64

In [13]:
print(type(s3))

<class 'pandas.core.series.Series'>

create a series using a scalar

In [77]:
s4=pd.Series(5, index=['a','b','c','d'])
s4

a    5
b    5
c    5
d    5
dtype: int64

Access the second element from series s3

In [17]:
s3=pd.Series({'a':10,'b':20,'c':30,'d':40})
s3
print(s3['b'])

20

In [18]:
print(s3[1])

20

C:\Users\Anshika Patel\AppData\Local\Temp\ipykernel_14240\4293192412.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s3[1])

Vector operations on series

In [20]:
s6=s3+s4
s6

a    15
b    25
c    35
d    45
dtype: int64

In [19]:
s5=s1+s3
s5

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [76]:
s7=pd.Series([100,200,300,400],index=['a','d','e','f'])
s7

a    100
d    200
e    300
f    400
dtype: int64

In [24]:
s8=s4+s7
s8

a    105.0
b      NaN
c      NaN
d    205.0
e      NaN
f      NaN
dtype: float64

Create a dataframe to store student's personal details like first name, last name, age, city. Store the details of atleast 5 students

In [29]:
s9=pd.Series({'First_name:':['Ram','Shyam','Tom','Jack','Ritu'] ,'Last_name:':['Sharma','Mishra','Verma','Rai','Singh'],'age:':[10,20,15,22,12] ,'city:':['Kanpur','Lucknow','Lucknow','Kanpur','Kanpur']})
s9

First_name:                 [Ram, Shyam, Tom, Jack, Ritu]
Last_name:            [Sharma, Mishra, Verma, Rai, Singh]
age:                                 [10, 20, 15, 22, 12]
city:          [Kanpur, Lucknow, Lucknow, Kanpur, Kanpur]
dtype: object

In [101]:
df1=pd.DataFrame({'First_name:':['Ram','Shyam','Tom','Jack','Ritu'] ,'Last_name:':['Sharma','Mishra','Verma','Rai','Singh'],'age:':[10,20,15,22,12] ,'city:':['Kanpur','Lucknow','Lucknow','Kanpur','Kanpur']})
df1

  First_name: Last_name:  age:    city:
0         Ram     Sharma    10   Kanpur
1       Shyam     Mishra    20  Lucknow
2         Tom      Verma    15  Lucknow
3        Jack        Rai    22   Kanpur
4        Ritu      Singh    12   Kanpur

In [31]:
s1=pd.Series(['a','b','c','d','e'])
s2=pd.Series(['p','q','r','s','t'])
s3=pd.Series([10,20,15,22,12])
s4=pd.Series(['Kanpur','Lucknow','Lucknow','Kanpur','Kanpur'])
df2=pd.DataFrame([s1,s2,s3,s4])
df2

        0        1        2       3       4
0       a        b        c       d       e
1       p        q        r       s       t
2      10       20       15      22      12
3  Kanpur  Lucknow  Lucknow  Kanpur  Kanpur

Print the age of all the students.

In [36]:
print(df1['age:'])

0    10
1    20
2    15
3    22
4    12
Name: age:, dtype: int64

In [37]:
print(df1[['Last_name:','city:']])

  Last_name:    city:
0     Sharma   Kanpur
1     Mishra  Lucknow
2      Verma  Lucknow
3        Rai   Kanpur
4      Singh   Kanpur

Find the details of students who lives in kanpur.

In [54]:
df1=df1[df1['city:']=='Kanpur'][['First_name:','Last_name:','age:']]
print(df1)

  First_name: Last_name:  age:
0         Ram     Sharma    10
3        Jack        Rai    22
4        Ritu      Singh    12

FInd details of students whose age > 20

In [63]:
df1=df1[df1['age:']>20]
print(df1)

  First_name: Last_name:  age:   city:
3        Jack        Rai    22  Kanpur

Find first name of students where age>20

In [64]:
df1=df1[df1['age:']>20]['First_name:']
print(df1)

3    Jack
Name: First_name:, dtype: object

Find first name and last name of students where age>20

In [68]:
df1=df1[df1['age:']>20][['First_name:','Last_name:']]
print(df1)

  First_name: Last_name:
3        Jack        Rai

Delete null values from a series.

In [73]:
s5=s1+s3
s5

0   NaN
1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [75]:
s5=s5.dropna()
s5

Series([], dtype: float64)

In [80]:
s8=s4+s7
s8

a    105.0
b      NaN
c      NaN
d    205.0
e      NaN
f      NaN
dtype: float64

In [83]:
#used to fill 0 to null or NaN places in a series
s8=s8.fillna(0)
s8

a    105.0
b      0.0
c      0.0
d    205.0
e      0.0
f      0.0
dtype: float64

Find the first name and age of students who lives in Lucknow using 'loc' method

loc - uses labels
iloc - select columns using indexing

In [96]:
#without using loc method
df1=df1[df1['city:']=='Lucknow'][['First_name:','age:']]
print(df1)

  First_name:  age:
1       Shyam    20
2         Tom    15

In [93]:
df1=df1[df1['city:']=='Lucknow'].loc[:,['First_name:','age:']]
print(df1)

  First_name:  age:
1       Shyam    20
2         Tom    15

In [99]:
#using iloc method
df1=df1.loc[df1['city:']=='Lucknow'].iloc[:,[0,2]]
print(df1)

  First_name:  age:
1       Shyam    20
2         Tom    15

In [ ]:
df1.head()

  First_name: Last_name:  age:    city:
0         Ram     Sharma    10   Kanpur
1       Shyam     Mishra    20  Lucknow
2         Tom      Verma    15  Lucknow
3        Jack        Rai    22   Kanpur
4        Ritu      Singh    12   Kanpur

In [ ]:
df1.head(3)  #rows from head

  First_name: Last_name:  age:    city:
0         Ram     Sharma    10   Kanpur
1       Shyam     Mishra    20  Lucknow
2         Tom      Verma    15  Lucknow

In [104]:
df1.tail(3) #rows from head

  First_name: Last_name:  age:    city:
2         Tom      Verma    15  Lucknow
3        Jack        Rai    22   Kanpur
4        Ritu      Singh    12   Kanpur

In [105]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   First_name:  5 non-null      object
 1   Last_name:   5 non-null      object
 2   age:         5 non-null      int64
 3   city:        5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes